## Graded Challenge 2

### Nama  : Stanly Sukmajaya
### Batch : RMT-036

### Program ini dibuat untuk melakukan data eksplorasi, data cleaning, data normalization dan mengekspor data yang telah diolah ke file .csv

### Import library pandas ke dalam file ini

In [624]:
import pandas as pd

# 1. Data Exploration

### a. Load file data dengan Pandas lalu tampilkan data. Informasi apa yang bisa kamu sampaikan dari langkah ini?

#### Dengan informasi ini saya bisa melihat high overview data. Data `financials.csv` merupakan data mengenai penjualan produk. Data desidiakan dalam beberapa kategori, termasuk segmentasi, negara, nama produk dan band diskon. Terdapat juga informasi mengenai waktu dimana barang tersebut terjual

In [625]:
financials = pd.read_csv("https://raw.githubusercontent.com/FTDS-learning-materials/phase-0/main/src/Financials.csv")
financials

,Segment,Country,Product,Discount Band,Units Sold,Manufacturing Price,Sale Price,Gross Sales,Discounts,Sales,COGS,Profit,Date,Month Number,Month Name,Year
0,Government,Canada,Carretera,None,"$1,618.50",$3.00,$20.00,"$32,370.00",$-,"$32,370.00","$16,185.00","$16,185.00",01/01/2014,1,January,2014
1,Government,Germany,Carretera,None,"$1,321.00",$3.00,$20.00,"$26,420.00",$-,"$26,420.00","$13,210.00","$13,210.00",01/01/2014,1,January,2014
2,Midmarket,France,Carretera,None,"$2,178.00",$3.00,$15.00,"$32,670.00",$-,"$32,670.00","$21,780.00","$10,890.00",01/06/2014,6,June,2014
3,Midmarket,Germany,Carretera,None,$888.00,$3.00,$15.00,"$13,320.00",$-,"$13,320.00","$8,880.00","$4,440.00",01/06/2014,6,June,2014
4,Midmarket,Mexico,Carretera,None,"$2,470.00",$3.00,$15.00,"$37,050.00",$-,"$37,050.00","$24,700.00","$12,350.00",01/06/2014,6,June,2014
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
695,Small Business,France,Amarilla,High,"$2,475.00",$260.00,$300.00,"$7,42,500.00","$1,11,375.00","$6,31,125.00","$6,18,750.00","$12,375.00",01/03/2014,3,March,2014
696,Small Business,Mexico,Amarilla,High,$546.00,$260.00,$300.00,"$1,63,800.00","$24,570.00","$1,39,230.00","$1,36,500.00","$2,730.00",01/10/2014,10,October,2014
697,Government,Mexico,Montana,High,"$1,368.00",$5.00,$7.00,"$9,576.00","$1,436.40","$8,139.60","$6,840.00","$1,299.60",01/02/2014,2,February,2014
698,Government,Canada,Paseo,High,$723.00,$10.00,$7.00,"$5,061.00",$759.15,"$4,301.85","$3,615.00",$686.85,01/04/2014,4,April,2014
699,Channel Partners,United States of America,VTT,High,"$1,806.00",$250.00,$12.00,"$21,672.00","$3,250.80","$18,421.20","$5,418.00","$13,003.20",01/05/2014,5,May,2014

### b. Tampilkan informasi summary data dan berikan penjelasan mengenai temuan yang diperoleh.

#### Beberapa data, yaitu `Month Number` dan `Year` sudah memiliki data type yang tepat, namun selain itu, data type nya salah. `Segment`, `Country`, `Product`, `Discount Band` dan `Month Name` seharusnya memiliki data type category. `Units Sold`, `Manufacturing Price`, `Sale Price`, `Gross Sales`, `Discounts`, `Sales`, `COGS` dan `Profit` seharusnya memiliki data type float

In [626]:
financials.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 16 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Segment                700 non-null    object
 1   Country                700 non-null    object
 2    Product               700 non-null    object
 3    Discount Band         700 non-null    object
 4    Units Sold            700 non-null    object
 5    Manufacturing Price   700 non-null    object
 6    Sale Price            700 non-null    object
 7    Gross Sales           700 non-null    object
 8    Discounts             700 non-null    object
 9     Sales                700 non-null    object
 10   COGS                  700 non-null    object
 11   Profit                700 non-null    object
 12  Date                   700 non-null    object
 13  Month Number           700 non-null    int64
 14   Month Name            700 non-null    object
 15  Year                   700 non-null    int64
dtypes: int64(2), object(14)
memory usage: 87.6+ KB

### c. Tampilkan list nama-nama kolom dan berikan penjelasan temuan apa yang kamu dapatkan, serta berikan langkah apa selanjutnya dari temuan ini.

#### Nama-nama kolom sudah deskriptif, hanya saja terdapat spasi yang tidak diperlukan. Nama-nama kolom ini sebaiknya dihilangkan spasi-spasinya yang tidak diperlukan menggunakan str.strip()

In [627]:
financials.columns = financials.columns.str.strip()
financials.columns

Index(['Segment', 'Country', 'Product', 'Discount Band', 'Units Sold',
       'Manufacturing Price', 'Sale Price', 'Gross Sales', 'Discounts',
       'Sales', 'COGS', 'Profit', 'Date', 'Month Number', 'Month Name',
       'Year'],
      dtype='object')

### d. Tampilkan list nilai unik masing-masing kolom `Segment`, `Country`, `Product`, `Discount Band` dan berikan informasi apa yang dapat kamu ambil dari langkah ini.

#### Informasi ini memberikan insight bahwa hanya ada sedikit nilai unik dari kolom segment, country, product dan discount band. Ini berarti kolom-kolom tersebut bisa di ganti tipe datanya sebagai category.

In [628]:
print("Segment:", financials["Segment"].unique())
print("Country:", financials["Country"].unique())
print("Product:", financials["Product"].unique())
print("Discount Band:", financials["Discount Band"].unique())

Segment: ['Government' 'Midmarket' 'Channel Partners' 'Enterprise' 'Small Business']
Country: ['Canada' 'Germany' 'France' 'Mexico' 'United States of America']
Product: [' Carretera ' ' Montana ' ' Paseo ' ' Velo ' ' VTT ' ' Amarilla ']
Discount Band: [' None ' ' Low ' ' Medium ' ' High ']

# 2. Data Cleaning

### Data cleaning untuk mengubah kolom-kolom yang seharusnya float, namun sekarang masih string.

In [629]:
financials["Sale Price"] = financials["Sale Price"].str.replace("$", "")
financials["Sale Price"] = financials["Sale Price"].str.replace(",", "")
financials["Gross Sales"] = financials["Gross Sales"].str.replace("$", "")
financials["Gross Sales"] = financials["Gross Sales"].str.replace(",", "")
financials["Manufacturing Price"] = financials["Manufacturing Price"].str.replace("$", "")
financials["Manufacturing Price"] = financials["Manufacturing Price"].str.replace(",", "")
financials["Units Sold"] = financials["Units Sold"].str.replace("$", "")
financials["Units Sold"] = financials["Units Sold"].str.replace(",", "")
financials["Discounts"] = financials["Discounts"].str.replace("$", "")
financials["Discounts"] = financials["Discounts"].str.replace(",", "")
financials["Discounts"] = financials["Discounts"].str.replace("-", "")
financials["Discounts"] = financials["Discounts"].str.strip()
financials["Discounts"] = financials["Discounts"].apply(lambda x: '0' if len(x) == 0 else x)
financials["COGS"] = financials["COGS"].str.replace("$", "")
financials["COGS"] = financials["COGS"].str.replace(",", "")
financials["Profit"] = financials["Profit"].str.replace("$", "")
financials["Profit"] = financials["Profit"].str.replace(",", "")
financials["Profit"] = financials["Profit"].str.replace("-", "")
financials["Profit"] = financials["Profit"].str.replace("(", "")
financials["Profit"] = financials["Profit"].str.replace(")", "")
financials["Profit"] = financials["Profit"].str.strip()
financials["Profit"] = financials["Profit"].apply(lambda x: '0' if len(x) == 0 else x)
financials["Sales"] = financials["Sales"].str.replace("$", "")
financials["Sales"] = financials["Sales"].str.replace(",", "")
financials[["Sale Price", "Gross Sales", "Sales", "Manufacturing Price", "Units Sold", "Discounts", "COGS", "Profit"]] = financials[["Sale Price", "Gross Sales", "Sales", "Manufacturing Price", "Units Sold", "Discounts", "COGS", "Profit"]].astype(float)

### Mengubah kolom `Date` menjadi tipe data datetime

In [630]:
financials["Date"] = pd.to_datetime(financials["Date"])

### Membersihkan data-data untuk menghilangkan spasi yang tidak diperlukan

In [631]:
financials["Segment"] = financials["Segment"].str.strip()
financials["Country"] = financials["Country"].str.strip()
financials["Product"] = financials["Product"].str.strip()
financials["Discount Band"] = financials["Discount Band"].str.strip()

### Mengubah kolom `segment`, `country`, `product` dan `discount band` menjadi tipe data category

In [632]:
financials[["Segment", "Country", "Product", "Discount Band"]] = financials[["Segment", "Country", "Product", "Discount Band"]].astype("category")

### Lihat keseluruhan data type pada data frame, apakah semuanya sudah sesuai keinginan?

In [633]:
financials.dtypes

Segment                      category
Country                      category
Product                      category
Discount Band                category
Units Sold                    float64
Manufacturing Price           float64
Sale Price                    float64
Gross Sales                   float64
Discounts                     float64
Sales                         float64
COGS                          float64
Profit                        float64
Date                   datetime64[ns]
Month Number                    int64
Month Name                     object
Year                            int64
dtype: object

# 3. Data Normalization

### Buat `segment` data frame, yang nantinya akan diexport menjadi csv, dan dimasukkan ke dalam database menggunakan SQL. Akan digunakan untuk mengubah data financials yang asli menjadi Segment_id pada kolom `segment`

In [634]:
segment = pd.DataFrame()
segment["Segment"] = financials["Segment"].unique()
segment.index = segment.index + 1
segment = segment.reset_index().rename(columns={'index': 'Segment_id'})
segment

   Segment_id           Segment
0           1        Government
1           2         Midmarket
2           3  Channel Partners
3           4        Enterprise
4           5    Small Business

### Buat `country` data frame, yang nantinya akan diexport menjadi csv, dan dimasukkan ke dalam database menggunakan SQL. Akan digunakan untuk mengubah data financials yang asli menjadi Country_id pada kolom `country`

In [635]:
country = pd.DataFrame()
country["Country"] = financials["Country"].unique()
country.index = country.index + 1
country = country.reset_index().rename(columns={'index': 'Country_id'})
country

   Country_id                   Country
0           1                    Canada
1           2                   Germany
2           3                    France
3           4                    Mexico
4           5  United States of America

### Buat `product` data frame, yang nantinya akan diexport menjadi csv, dan dimasukkan ke dalam database menggunakan SQL. Akan digunakan untuk mengubah data financials yang asli menjadi Product_id pada kolom `product`

In [636]:
product = pd.DataFrame()
product["Product"] = financials["Product"].unique()
product.index = product.index + 1
product = product.reset_index().rename(columns={'index': 'Product_id'})
product

   Product_id    Product
0           1  Carretera
1           2    Montana
2           3      Paseo
3           4       Velo
4           5        VTT
5           6   Amarilla

### Buat `discount_band` data frame, yang nantinya akan diexport menjadi csv, dan dimasukkan ke dalam database menggunakan SQL. Akan digunakan untuk mengubah data financials yang asli menjadi DiscountBand_id pada kolom `Discount Band`

In [637]:
discount_band = pd.DataFrame()
discount_band["Discount_Band"] = financials["Discount Band"].unique()
discount_band.index = discount_band.index + 1
discount_band = discount_band.reset_index().rename(columns={'index': 'DiscountBand_id'})
discount_band

   DiscountBand_id Discount_Band
0                1          None
1                2           Low
2                3        Medium
3                4          High

### Rename nama kolom agar tidak ada spasi, dan juga `segment`, `country`, `product`, `discount band` akan di rename menjadi kolom-kolom ID, karena akan di relasikan dengan data frame yang sesuai

In [638]:
financials = financials.rename(columns={'Segment': 'Segment_id', 
                                        'Country': 'Country_id', 
                                        'Product': 'Product_id', 
                                        'Discount Band': 'DiscountBand_id', 
                                        'Units Sold': 'Units_Sold', 
                                        'Manufacturing Price': 'Manufacturing_Price',
                                        'Sale Price': 'Sale_Price',
                                        'Gross Sales': 'Gross_Sales'
                                        })

### Drop kolom `month name`, `month number` dan `year` karena redundan, dan menyalahi aturan 3NF. Jika data `month name` berubah, maka kita juga harus mengubah `month number`. Sama halnya dengan `year`, jika `Date` berubah, maka kita harus mengubah data `year`. Data-data `month name`, `month number` dan `year` sudah ada di kolom `Date`.

In [639]:
financials.drop(columns=["Month Name", "Month Number", "Year"], inplace=True)

### Mengganti data-data di segment yang sebelumnya merupakan nama segment, sekarang di representasikan dengan Segment_id yang nama segment nya di representasikan di dataframe `segment`

In [640]:
segment_to_id = segment.set_index("Segment")["Segment_id"].to_dict()
financials['Segment_id'] = financials['Segment_id'].map(segment_to_id)

### Mengganti data-data di segment yang sebelumnya merupakan nama `country`, sekarang di representasikan dengan Country_id yang nama `country` nya di representasikan di dataframe `country`

In [641]:
country_to_id = country.set_index("Country")["Country_id"].to_dict()
financials['Country_id'] = financials['Country_id'].map(country_to_id)

### Mengganti data-data di segment yang sebelumnya merupakan nama `product`, sekarang di representasikan dengan Product_id yang nama `product` nya di representasikan di dataframe `product`

In [642]:
product_to_id = product.set_index("Product")["Product_id"].to_dict()
financials['Product_id'] = financials['Product_id'].map(product_to_id)

### Mengganti data-data di `discount band` yang sebelumnya merupakan nama `discount band`, sekarang di representasikan dengan DiscountBand_id yang nama `discount band` nya di representasikan di dataframe `discount_band`

In [643]:
discount_band_to_id = discount_band.set_index("Discount_Band")["DiscountBand_id"].to_dict()
financials['DiscountBand_id'] = financials['DiscountBand_id'].map(discount_band_to_id)

### export semua data yang bersangkutan ke file .csv. Tidak perlu meng-ekspor index nya, karena akan dipakai di SQL

In [644]:
financials.to_csv("financials.csv", index=False)
segment.to_csv("segments.csv", index=False)
country.to_csv("countries.csv", index=False)
product.to_csv("products.csv", index=False)
discount_band.to_csv("discount_bands.csv", index=False)

### Hasil akhir `financials` Data Frame

In [645]:
financials

,Segment_id,Country_id,Product_id,DiscountBand_id,Units_Sold,Manufacturing_Price,Sale_Price,Gross_Sales,Discounts,Sales,COGS,Profit,Date
0,1,1,1,1,1618.5,3.0,20.0,32370.0,0.00,32370.00,16185.0,16185.00,2014-01-01
1,1,2,1,1,1321.0,3.0,20.0,26420.0,0.00,26420.00,13210.0,13210.00,2014-01-01
2,2,3,1,1,2178.0,3.0,15.0,32670.0,0.00,32670.00,21780.0,10890.00,2014-01-06
3,2,2,1,1,888.0,3.0,15.0,13320.0,0.00,13320.00,8880.0,4440.00,2014-01-06
4,2,4,1,1,2470.0,3.0,15.0,37050.0,0.00,37050.00,24700.0,12350.00,2014-01-06
...,...,...,...,...,...,...,...,...,...,...,...,...,...
695,5,3,6,4,2475.0,260.0,300.0,742500.0,111375.00,631125.00,618750.0,12375.00,2014-01-03
696,5,4,6,4,546.0,260.0,300.0,163800.0,24570.00,139230.00,136500.0,2730.00,2014-01-10
697,1,4,2,4,1368.0,5.0,7.0,9576.0,1436.40,8139.60,6840.0,1299.60,2014-01-02
698,1,1,3,4,723.0,10.0,7.0,5061.0,759.15,4301.85,3615.0,686.85,2014-01-04
699,3,5,5,4,1806.0,250.0,12.0,21672.0,3250.80,18421.20,5418.0,13003.20,2014-01-05

# Pengujian Database

### a. Berikan tabel yang berisikan informasi total profit yang didapatkan di tiap jenis segmentasi. Jangan ambil data yang tidak diskon.

```sql
SELECT 
  s.segment, 
  ROUND(SUM(f.profit)::numeric, 2) AS total_profit 
FROM financials f 
  JOIN segments s 
  ON s.segment_id = f.segment_id 
  WHERE f.discounts > 0
  GROUP BY s.segment 
  ORDER BY total_profit DESC
```

In [646]:
financial_segments = pd.read_csv("financial_segments_profit.csv")
financial_segments

            segment  total_profit
0        Government   10270950.18
1    Small Business    3848268.50
2  Channel Partners    1150321.14
3        Enterprise     879096.88
4         Midmarket     563253.09

### b. Berikan tabel yang berisikan informasi rangkuman statistik yang memuat nilai rata-rata, min, dan max (dijadikan dalam kolom yang berbeda) dari Sales masing-masing negara.

```sql
SELECT
  c.country,
  ROUND(AVG(f.sales)::numeric, 2) AS avg_sales,
  MIN(f.sales) AS min_sales,
  MAX(f.sales) AS max_sales
FROM financials f
  JOIN countries c
  ON c.country_id = f.country_id
  GROUP BY c.country
  ORDER BY avg_sales DESC
```

In [647]:
country_total_sales = pd.read_csv("country_total_sales.csv")
country_total_sales

                    country  avg_sales  min_sales  max_sales
0  United States of America  178784.50    1730.54  1159200.0
1                    Canada  177768.96    1655.08  1038082.5
2                    France  173958.37    1763.86   962500.0
3                   Germany  167895.29    1685.60  1017338.0
4                    Mexico  149638.23    2508.66   848172.5